app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores"
---
  def index
    @stores = Store.all

INSERT INTO "stores" ("name", "description", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "寵物用品店"], ["description", "專賣毛小孩用品"], ["phone", "0800-555-555"], ["address", "貓貓村"], ["created_at", "2017-10-09 23:35:09.655436"], ["updated_at", "2017-10-09 23:35:09.655436"]]
---
  def create
    store = Store.new store_params
    #params是hash被指定的變數，後面用[]把key包進去，就能找到對應的value
    # store = Store.new params[:store]
    # store.name = params[:name]
    # store.description = params[:description]
    # store.phone = params[:phone]
    # store.address = params[:address]

    store.save

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @store = Store.find params[:id]